app/views/prices/_form.html.erb

    <%= f.label :product %><br>
    <%= collection_select(:product, :product_id, Product.all, :id, :name, :prompt => 'Please select product') %>
---
SELECT "products".* FROM "products"