app/views/countries/_form.html.erb

<div class="authform">
  <% if !@country.inflations.blank? %>
---
SELECT "inflations".* FROM "inflations" WHERE "inflations"."country_id" = ?  [["country_id", 1]]