app/controllers/countries_controller.rb

INSERT INTO "countries" ("code", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["code", "SE"], ["created_at", Wed, 19 Feb 2014 17:04:57 UTC +00:00], ["name", "Sweden"], ["updated_at", Wed, 19 Feb 2014 17:04:57 UTC +00:00]]
---
  def create
    @country = Country.new(country_params)

    respond_to do |format|
      if @country.save

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_country
      @country = Country.find(params[:id])