app/controllers/inflations_controller.rb

SELECT "inflations".* FROM "inflations"
---
  def index
    @inflations = Inflation.all