app/controllers/inflations_controller.rb

  def index
    @inflations = Inflation.order(:year)
---
SELECT "inflations".* FROM "inflations" ORDER BY "inflations"."year" ASC

  def new
	@country = Country.find(params[:country_id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	  puts "-------------------set_inflation DEBUG1--------------------"
	  puts params
	  puts "-------------------set_inflation DEBUG2--------------------"
	  puts inflation_params
	  puts "-------------------set_inflation DEBUG3--------------------"

	@country = Country.find(params[:country_id])
    @inflation = Inflation.new(inflation_params)
	@inflation.country_id = @country.id

    respond_to do |format|
      if @inflation.save
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "inflations" ("country_id", "created_at", "inflation", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["country_id", 1], ["created_at", Thu, 20 Feb 2014 19:55:55 UTC +00:00], ["inflation", 4.0], ["updated_at", Thu, 20 Feb 2014 19:55:55 UTC +00:00], ["year", 2013]]

  def update

    respond_to do |format|
      if @inflation.update(inflation_params)
---
UPDATE "inflations" SET "inflation" = ?, "updated_at" = ? WHERE "inflations"."id" = 1  [["inflation", 2.22], ["updated_at", Thu, 20 Feb 2014 16:37:56 UTC +00:00]]

  def destroy
    @inflation.destroy
---
DELETE FROM "inflations" WHERE "inflations"."id" = ?  [["id", 2]]

    def set_country
      @country = Country.find(params[:country_id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? ORDER BY "countries"."id" ASC LIMIT 1  [["id", 1]]

    def set_inflation
	  @country = Country.find(params[:country_id])
	  puts "Country : " + @country.name
      @inflation = Inflation.find(params[:id])
---
SELECT "inflations".* FROM "inflations" WHERE "inflations"."id" = ? LIMIT 1  [["id", "2"]]