app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

INSERT INTO "prices" ("created_at", "price", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 19 Feb 2014 17:06:55 UTC +00:00], ["price", 180.95], ["updated_at", Wed, 19 Feb 2014 17:06:55 UTC +00:00]]
---
  def create
    @price = Price.new(price_params)

    respond_to do |format|
      if @price.save

UPDATE "prices" SET "pdatetime" = ?, "updated_at" = ? WHERE "prices"."id" = 1  [["pdatetime", Wed, 19 Feb 2014 00:00:00 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 17:25:30 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @price.update(price_params)

SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_price
      @price = Price.find(params[:id])