app/controllers/products_controller.rb

  def perform_search
    if params[:q] && params[:q] != ""
      @products = Product.where("name LIKE '#{params[:q]}'")   #.page(params[:page])
      #render 'index'
    else
      @products = Product.order(:name) #.page(params[:page])
---
SELECT "products".* FROM "products" WHERE (name LIKE 'A')
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("country_id", "created_at", "desc", "name", "ptype", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["country_id", 1], ["created_at", Thu, 27 Feb 2014 08:38:32 UTC +00:00], ["desc", "444444"], ["name", "444444"], ["ptype", "Stock"], ["updated_at", Thu, 27 Feb 2014 08:38:32 UTC +00:00]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "desc" = ?, "country_id" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["desc", "VOLVO's in NORGE right?"], ["country_id", 4], ["updated_at", Sun, 02 Mar 2014 23:56:12 UTC +00:00]]