app/views/products/_form.html.erb

SELECT "countries".* FROM "countries"
---
      <div class="col-sm-10">
        <%= f.collection_select :country_id, Country.all, :id, :name, {:include_blank => false} , {:class => "collection_select"} %>